Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱིས་ནི་དོན་རྣམས་སྦྱོང་། །
en: With wisdom, the meaning of things becomes clearer,

source: དོན་རྙེད་ནས་ནི་བདེ་འཐོབ་འགྱུར། །
en: And when one grasps the meaning of things, one reaches happiness.

source: དོན་རྙེད་དེ་ནི་ཡིད་རྣོ་སྟེ། །
en: “Those whose wits are sharp will grasp the meaning of things,

source: ཆོས་གཙང་མཁས་པ་གཙང་མ་དང་། །མཆོག་ཏུ་བདེ་བ་ཐོབ་པར་འགྱུར། །
en: With the pure Dharma and skill in purification, He achieves the ultimate happiness.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འཕགས་པའི་ཆོས་འདུལ་བ་ཤིན་ཏུ་མཉན་པར་བྱ། བླང་བར་བྱ། གཟུང་བར་བྱ། བཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། ། ཤཱ་རིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མི་ཉན་པ་དང་། ཚུལ་བཞིན་དུ་སྦྱོར་བར་མི་བྱེད་པ་དེ་དག་ནི་འཕགས་པའི་ལམ་ལས་ཡོངས་སུ་ཉམས་པར་འགྱུར་ཏེ དེ་ལ་དགོངས་ནས་དེ་བཞིན་གཤེགས་པ་འདི་སྐད་དུ་བདག་ཉིད་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ནི་རྒ་བ་དང་། ན་བ་དང་འཆི་བ་ལས་གྲོལ་བའོ་ཞེས་གསུང་ངོ་། །
en: “Therefore, Śāriputra, the bodhisatva should engage in extensive study of the cycle of teachings contained in The Collected Teachings on the Bodhisatva, the noble teachings of discipline. He should learn them, memorize them, absorb them, and teach them in great detail to others. Śāriputra, those who do not study the cycle of teachings contained in The Collected Teachings on the Bodhisatva, and who only apply themselves in a superficial way, abandon the noble path. With this in mind, the Tathāgata gives this advice: ‘With a proper understanding of oneself, one will be freed from aging and death.’

source: དེ་འདི་ལྟར་སློབ་སྟེ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་སྦྱོར་བ་ནི་གང་། ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་སྦྱོར་བ་ཡིན་སྙམ་ནས་དེ་འདི་ལྟར་སློབ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་གང་ལ་ཡང་སྦྱོར་བར་མི་བྱེད་རབ་ཏུ་སྦྱོར་བར་མི་བྱེད་དོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བ་ཞེས་བྱ་བ་དེ་ནི་མི་སྦྱོར་བའི་ཚིག་བླ་དགས་སོ། །
en: “In the context of this training, what is a bodhisatva’s non-superficial practice like? How does a bodhisatva practice in a way that is not superficial? As he engages in this training, the bodhisatva, the great being, does not apply himself to any Dharma teachings whatsoever. He does not undertake anything. Non-superficial engagement in this context is another term for nonengagement.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་སྒྲ་འབྱིན་པར་མི་བྱེད། ཟློས་པ་འབྱིན་པར་མི་བྱེད། གང་ནས་སྒྲ་འབྱུང་བ་དེ་ཡང་མི་དམིགས། སྒྲ་དེ་ཉིད་གང་ནས་བྱུང་། གང་དུ་འགག་ཅེས་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ལ་རྟོག་པར་བྱེད་དེ། གང་སྨྲས་པ་དང་། གང་སྨྲ་བ་དང་། གང་སྨྲ་བར་འགྱུར་བ་དང་། གང་གིས་སྨྲས་པ་དང་། གང་གིས་སྨྲ་བ་དང་། གང་གིས་སྨྲ་བར་འགྱུར་བ་དང་། གང་སྤོང་བའི་ཕྱིར་སྨྲས་པ་དང་། གང་སྤོང་བའི་ཕྱིར་སྨྲ་བ་དང་། གང་སྤོང་བའི་ཕྱིར་སྨྲ་བར་འགྱུར་བ་དང་། གང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སྨྲས་པ་དང་། གང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སྨྲ་བ་དང་། གང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སྨྲ་བར་འགྱུར་བ་དེ་ཐམས་ཅད་ཡོངས་སུ་བཙལ་ན་འདས་པའི་རྣམ་པ་དང་། མ་འོངས་པའི་རྣམ་པ་དང་། ད་ལྟར་བྱུང་བའི་རྣམ་པར་མི་དམིགས་པ་དེ་ནི་དེའི་ཚུལ་བཞིན་སྦྱོར་བའོ་ཞེས་དེ་དེ་ལྟར་སློབ་བོ། །
en: “Furthermore, the bodhisatva whose engagement is not superficial does not have to make his voice heard. He does not have to repeat himself. It is not possible to understand where his voice issues from. It is not possible to discern a beginning or end to his voice. Where does it arise from? Where does it go? If one searches for what he has said, what he is saying, what he will say, who he spoke for, who he is speaking for, or who he will speak for, for the person he spoke to in order to encourage them to exert themselves, for the person he is speaking to in order to encourage them to exert themselves, for the person he will speak to in order to encourage them to exert themselves, for the person he spoke to in order to help them attain realization, for the person he is speaking to in order to help them attain realization, or for the person he will speak to in order to help them attain realization, one will not be able find any trace of these things in the past, the future, or the present. This is the kind of non-superficial engagement that he trains himself in.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཚུལ་བཞིན་དུ་སྦྱོར་བས་ཇི་ལྟར་ན་ཚུལ་བཞིན་དུ་མཐོང་ཞེ་ན དེ་འདི་ལྟར་སློབ་སྟེ་གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་དང་རང་བཞིན་གྱིས་འགགས་པར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། གང་གི་ཚེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཉེ་བར་ཞི་བར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། གང་གི་ཚེ་ཆོས་ཐམས་ཅད་རྣམ་པར་ཞི་བར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། གང་གི་ཚེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྙོམས་པར་མ་ཞུགས་པར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། གང་གི་ཚེ་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། གང་གི་ཚེ་ཆོས་ཐམས་ཅད་མ་བྱུང་བར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། གང་གི་ཚེ་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་ཡང་དག་པར་མ་བྱུང་བར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། གང་གི་ཚེ་ཆོས་ཐམས་ཅད་མྱ་ངན་ལས་འདས་པར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་མཐོང་ངོ་། ། དེ་གང་གིས་མཐོང་བ་དེ་ལ་ཡང་རྟོག་སྟེ། ཅི་ནས་ཀྱང་མི་མཐོང་བ་དང་། མི་རྟོག་པ་དེ་ལྟར་མཐོང་སྟེ། དེ་ལྟར་མཐོང་ན་ཚུལ་བཞིན་མཐོང་བ་ཞེས་བྱའོ། །
en: “When he engages in this non-superficial way, what is it the bodhisatva sees in a way that is not superficial? As he engages in this training, the bodhisatva sees that it is the nature of all phenomena to cease, and this is when he sees things in a way that is not superficial. When he sees that it is the nature of all phenomena that they are passive, this is when he sees things in a way that is not superficial. When he sees that all phenomena are calm, this is when he sees things in a way that is not superficial. When he sees that it is the nature of all phenomena that they are imperfect, this is when he sees things in a way that is not superficial. When he sees that all phenomena are unborn, this is when he sees things in a way that is not superficial. When he sees that all phenomena are unarisen, this is when he sees things in a way that is not superficial. When he sees that all phenomena are completely unarisen, this is when he sees things in a way that is not superficial. When he sees all phenomena as final nirvāṇa, this is when he sees things in a way that is not superficial. In this way, he sees; he discerns; and he sees in such a way that he does not see and does not discern. Because he sees in this way, he is known as someone who sees in a way that is not superficial.

source: ཡང་འདི་ལྟར་སློབ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ལ་ཡང་ཐེ་ཚོམ་དང་རྨོངས་པ་མེད་དོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ལ་ཡང་སྒྲིབ་པ་མེད་དོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ལ་ཡང་གང་ཐར་པའི་སྒོར་མི་འགྱུར་བ་མེད་དོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ཡང་སྤང་བར་བྱ་བའི་ཕྱིར་འབད་པ་མེད་དོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ལ་ཡང་རྟོགས་པར་བྱ་བའི་ཕྱིར་འབད་པ་མེད་དེ། གང་ཆོས་ཐམས་ཅད་ཡང་དག་པར་མཐོང་བ་དང་། ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་དེ་ནི་ཡང་དག་པར་ལྟ་བའོ། ། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་མ་མཐོང་བའོ། ། མ་མཐོང་བ་ཞེས་བྱ་བ་དེ་ནི་མ་སྐྱེས་པའི་ཚིག་བླ་དགས་སོ། ། མ་སྐྱེས་པ་ཞེས་བྱ་བ་དེ་ནི་ཡང་དག་པར་མ་བྱུང་བའི་ཚིག་བླ་དགས་སོ། །
en: “Furthermore, as he trains in this way, the bodhisatva who relates to things in a way that is not superficial does not harbor any doubt or confusion in relation to any phenomena. There are no phenomena that remain hidden from someone who relates to things in a way that is not superficial. There are no phenomena that do not become a door to liberation for someone who relates to things in a way that is not superficial. Someone who relates to things in a way that is not superficial does not have to make an effort to get rid of any phenomena. Someone who relates to things in a way that is not superficial does not have to make an effort to attain realization of any phenomena. To have a non-superficial view of things is to perceive all phenomena in a non-superficial way, to perceive them just as they are.

source: ཡང་དག་པར་མ་བྱུང་བ་ཞེས་བྱ་བ་གང་ཞེ་ན། དེ་ནི་མི་སྣང་བའི་ཚིག་བླ་དགས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་ལ་དགོངས་ནས་འདུ་བྱེད་ཐམས་ཅད་མི་སྐྱེ་བར་མཐོང་ན་ཡང་དག་པ་ཉིད་དུ་ངེས་པ་ལ་འཇུག་སྟེ། འདི་ལྟ་སྟེ་ཡང་དག་པ་ཉིད་དུ་ངེས་པ་ལ་འཇུག་པ་དེ་ནི་ཡང་དག་པར་ལྟ་བའོ། ། ཞེས་དེ་སྐད་གསུང་ངོ་། །
en: “What does it mean to perceive all phenomena just as they are? This is nonperception. What does nonperception imply? It implies the use of the designation unborn. Unborn is another word for unarisen. What does unarisen mean? It is another word for something that cannot appear. With this in mind, the Tathāgata said the following: ‘Seeing that all conditioned things are unborn is the way to attain a definitive connection with the true state. This is right view.’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཅིའི་ཕྱིར་ན་ཡང་དག་པ་ཉིད་དུ་ངེས་པ་ལ་འཇུག་པ་ཞེས་བྱ་ཞེས་དེ་འདི་ལྟར་སློབ་སྟེ། ཆོས་ཐམས་ཅད་གང་དང་མཉམ་པ་སངས་རྒྱས་ཀྱི་ཆོས་དེ་དང་མཉམ་སྟེ། དེ་བས་ན་ཡང་དག་པ་ཉིད་དུ་ངེས་པ་ལ་འཇུག་པའོ། ། དེ་ལྟ་བས་ན་ཡང་དག་པ་ཉིད་དུ་ངེས་པ་ལ་འཇུག་འདོད་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ཤིན་ཏུ་མཉན་པར་བྱ། བླང་བར་བྱ། གཟུང་བར་བྱ། བཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་ཡང་ཚུལ་བཞིན་དུ་སྦྱར་བར་བྱ་སྟེ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “One might wonder, ‘Why is this described as “attaining a certain connection with the true state”?’ Then one should train oneself in the following way: ‘Whatever is the same as all phenomena is the same as the qualities of the Buddha.’ This can be described as ‘attaining a definitive connection with the true state.’ Therefore, those who wish to attain a definitive connection with the true state should study, learn, memorize, recite, and absorb this very cycle of teachings contained in The Collected Teachings on the Bodhisatva in great detail. They should genuinely engage with this very cycle of teachings contained in The Collected Teachings on the Bodhisatva in a way that is not superficial. This, Śāriputra, is how the bodhisatva practices the perfection of wisdom.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ལྟར་བློ་ཤིན་ཏུ་ཡོངས་སུ་སྦྱངས་པ་དང་། དེ་ལྟར་ཆོས་སྣང་བའི་སྒོ་ཤིན་ཏུ་ཡོངས་སུ་དག་པས་ཚུལ་བཞིན་དུ་འཇུག་པ་ལ་བརྩོན་ན་ཚུལ་བཞིན་གྱི་ཚིག་མཐོང་ངོ་། ། དེ་ལ་ཚུལ་བཞིན་དུ་འཇུག་པ་གང་། ཚུལ་བཞིན་གྱི་ཚིག་གང་ཞེ་ན། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་དུ་འཇུག་པ་ནི་འདི་ལྟ་སྟེ། ཞི་གནས་ཀྱི་གནས་ལ་འཇུག་པ་དང་། ལྷག་མཐོང་རྣམ་པར་རྟོག་པ་ལ་འཇུག་པ་ནི་ཚུལ་བཞིན་དུ་འཇུག་པའོ། ། ལུས་དབེན་པར་འཇུག་པ་དང་། སེམས་ཡིད་དུ་འོང་བར་འཇུག་པ་དང་། ཆད་པ་མ་ཡིན་པར་འཇུག་པ་དང་། རྟག་པ་མ་ཡིན་པར་འཇུག་པ་དང་། རྒྱུ་དང་རྐྱེན་ལ་འཇུག་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་འཇུག་པ་དང་། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པ་ལ་འཇུག་པ་དང་། མ་འོངས་མ་ཕྱིན་མི་གནས་པ་ལ་འཇུག་པ་དང་། མི་འཕོ་བ་དང་། རྒྱུ་དང་འབྲས་བུ་ཆུད་མི་ཟ་བ་དང་། རྒྱུ་སྟོང་པ་ཉིད་ད་དུ་རྣམ་པར་འབྱེད་པ་ལ་འཇུག་པ་དང་། མཚན་མ་མེད་པར་འདྲིས་པར་བྱ་བ་ལ་འཇུག་པ་དང་། སྨོན་པ་མེད་པར་རབ་ཏུ་ཤེས་པ་ལ་འཇུག་ཀྱང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལེན་པར་འཇུག་པ་མ་ཡིན་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལེན་པ་ལ་འཇུག་ཀྱང་ཏིང་ངེ་འཛིན་གྱི་དབང་གིས་སྐྱེ་བ་ལ་མི་འཇུག་པ་དང་། མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ལེན་པ་ལ་འཇུག་ཀྱང་ཟག་པ་ཟད་པ་ལ་མི་འཇུག་པ་དང་། མི་སྐྱེ་བར་རྟོག་པ་ལ་འཇུག་ཀྱང་ངེས་པར་གྱུར་པར་འགྲོ་བ་ལ་མི་འཇུག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་བདག་མེད་པར་རྟོགས་པར་འཇུག་ཀྱང་སྙིང་རྗེ་ཆེན་པོ་གཏོང་བ་ལ་མི་འཇུག་པ་དང་། སྐྱེ་བ་ཐམས་ཅད་འཇིག་པར་མཐོང་བ་ལ་འཇུག་ཀྱང་སྲིད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལེན་པ་ལ་འཇུག་པ་དང་། མྱ་ངན་ལས་འདའ་བར་འདོད་པ་ལ་འཇུག་ཀྱང་ཆོས་མངོན་དུ་བྱ་བ་ལ་མི་འཇུག་པ་དང་། འདོད་པའི་ཡོན་ཏན་གྱི་དགའ་བ་དང་། བཏང་སྙོམས་པ་ལ་འཇུག་ཀྱང་ཆོས་ཀྱི་དགའ་བ་འདོར་བ་ལ་མི་འཇུག་པ་དང་། རྟོག་པ་སྤྲོས་པ་ཐམས་ཅད་གཏོང་བ་ལ་འཇུག་ཀྱང་ཐབས་མཁས་པ་གཏོང་བ་ལ་མི་འཇུག་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་ནི་ཚུལ་བཞིན་དུ་འཇུག་པ་ཞེས་བྱའོ། །
en: “Furthermore, Śāriputra, when the bodhisatva practices the perfection of wisdom, making an effort to apply himself in a way that is not superficial by purifying his intellect and by completely cleansing the doors through which he perceives phenomena, he will see what non-superficial words are. What does it mean to apply oneself in a way that is not superficial, in this context? What are non-superficial words? The bodhisatva applies himself in a way that is not superficial as follows: He applies himself to gaining stability in calm abiding meditation, and he applies himself to analysis in insight meditation. This is what it means to apply oneself in a way that is not superficial. He applies himself with his body secluded and his mind delighted. He applies himself to the fact that there is no annihilation, and to the fact that there is no permanence. He applies himself to causes and conditions, and to dependent origination. He applies himself to the fact that there is no being, no life force, and no person, and to the fact that there is no coming, no going, and no remaining. He applies himself to the fact that there is no transference, the fact that causes and effects are inconsequential, and to the investigation of the emptiness of causes. He applies himself to the investigation of freedom from attributes, and to the investigation of freedom from aspirations. He does not, however, reify emptiness, freedom from attributes, and freedom from aspirations. He applies himself to the attainments of concentration, but he does not become involved in the kind of birth that comes about through the power of concentrations. He applies himself to gaining knowledge related to the superior abilities, but he does not become entangled in eliminating the defilements. He applies himself to examining nonbirth, but he does not end up on a fixed course. He applies himself to examining the fact that no sentient beings have a self, but he does not end up losing his great compassion. He maintains the perspective that all kinds of birth are terrifying, but he still takes unimaginably many existences upon himself. He does not give up his yearning for nirvāṇa, but he does not reify the Dharma. He remains indifferent to the delights of sensual pleasures, but he does not disregard the joys of the Dharma. He renounces deliberation, which only proliferates itself, but he does not disregard skillful means. This, Śāriputra, is what it means to apply oneself in a way that is not superficial.

source: ཤཱ་རིའི་བུ་ཚུལ་བཞིན་གྱི་ཚིག་ཅེས་བྱ་བ་གང་ཞེ་ན། རིགས་པའི་ཚིག་དེ་ནི་ཚུལ་བཞིན་གྱི་ཚིག་གོ ། ཤཱ་རིའི་བུ་གཞན་ཡང་ཚུལ་བཞིན་གྱི་ཚིག་དེ་ནི་ཚུལ་གྱི་ཚིག་གོ ། དེ་ནི་སྒོའི་ཚིག་གོ ། དེ་ནི་ཁའི་ཚིག་གོ ། དེ་ནི་རྒྱུའི་ཚིག་གོ ། དེ་ནི་རབ་ཏུ་རྣམ་པར་འབྱེད་པའི་ཚིག་གོ ། དེ་ནི་མི་འགལ་བའི་ཚིག་གོ ། དེ་ནི་མི་རྩོད་པའི་ཚིག་གོ ། དེ་ནི་བཏང་སྙོམས་ཀྱི་ཚིག་གོ ། མི་ལེན་པའི་ཚིག་དང་། མི་འདོར་བའི་ཚིག་དང་། མ་སྤྲོས་པའི་ཚིག་དང་། མི་བསྣན་པའི་ཚིག་དང་། མ་བྲི་བའི་ཚིག་དང་། མི་སྐྱེ་བའི་ཚིག་དང་། རྩོད་པའི་གཞི་མེད་པའི་ཚིག་དང་། མི་ལྡོག་པའི་ཚིག་དང་། གཉེན་པོ་མེད་པའི་ཚིག་དང་། དེ་ཁོ་ནའི་ཚིག་དང་། དེ་བཞིན་ཁོ་ནའི་ཚིག་དང་། མ་ལོག་པ་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཚིག་དང་། ཇི་ལྟ་བ་བཞིན་གྱི་ཚིག་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཚིག་དང་། ཡོངས་སུ་ཆད་པའི་ཚིག་དང་། གཟུགས་རྣམ་པར་ཤེས་པའི་གནས་མེད་པའི་ཚིག་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་གནས་མེད་པའི་ཚིག་གོ ། དེ་ནི་མིག་དང་། གཟུགས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་གནས་མེད་པའི་ཚིག་གོ ། དེ་ནི་རྣ་བ་དང་། སྒྲ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་གནས་མེད་པའི་ཚིག་གོ ། དེ་ནི་སྣ་དང་། དྲི་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་གནས་མེད་པའི་ཚིག་གོ ། དེ་ནི་ལྕེ་དང་། རོ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་གནས་མེད་པའི་ཚིག་གོ ། དེ་ནི་ལུས་དང་། རེག་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་གནས་མེད་པའི་ཚིག་གོ ། དེ་ནི་ཡིད་དང་། ཆོས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་གནས་མེད་པའི་ཚིག་གོ ། དེ་ནི་དོན་ལ་རྟོན་པའི་ཚིག་གོ ། དེ་ནི་ཆོས་ལ་རྟོན་པའི་ཚིག་གོ ། དེ་ནི་ཡེ་ཤེས་ལ་རྟོན་པའི་ཚིག་གོ ། དེ་ནི་ངེས་པའི་དོན་གྱི་མདོ་སྡེ་ལ་རྟོན་པའི་ཚིག་སྟེ། ཤཱ་རིའི་བུ་དེ་ནི་ཚུལ་བཞིན་གྱི་ཚིག་གོ །
en: “What is meant by non-superficial words, Śāriputra? Words that make sense are not superficial. Furthermore, Śāriputra, words that are not superficial are words that guide one. They are words that act as a door. They are words that give one direction. They are words that are a cause. They are words of investigation. They are words that are not contradictory. They are words that cannot be disputed. They are words of equanimity. They are words that do not attract. They are words that do not push away. They are words that do not proliferate. They are words that do not dwindle away. They are words that do not shrink. They are words that do not arise. They are words that do not give any grounds for disagreement. They are words that cannot be refuted. They are words that cannot be opposed. They are words for what is essential. They are words for the way things are. They are words that are not false. They are words that are nothing other than what they are. They are words for the actual state of things. They are words for what is actually the case. They are words that are the same throughout the three times. They are words that are precise. They are words that are not limited to the physical objects of perception. They are words that are not limited to feeling, perception, mental conditioning, or consciousness. They are words that are not limited to the realm of the eye, forms, and the eye consciousness. They are words that are not limited to the realm of the ear, sound, and the ear consciousness. They are words that are not limited to the realm of the nose, smell, and the nose consciousness. They are words that are not limited to the realm of the tongue, taste, and the tongue consciousness. They are words that are not limited to the realm of the body, physical objects, and body consciousness. They are words that are not limited to the realm of the mind, mental objects, and mental consciousness. They are words that rely on the meaning. They are words that rely on the Dharma. They are words that rely on knowledge. They are words that rely on the explicit meaning. These, Śāriputra, are words that are not superficial.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་དུ་འཇུག་པ་ལ་བརྩོན་པ། ཚུལ་བཞིན་གྱི་ཚིག་མཐོང་བ་དེ་ནི་གང་གིས་མཐོང་བ་དེ་ཉིད་མི་མཐོང་སྟེ། ཇི་ལྟར་མི་མཐོང་རྣམ་པར་མི་མཐོང་བ་དེ་ལྟར་མཐོང་ངོ་། ། དེ་ལྟར་མཐོང་ན་ཚུལ་བཞིན་མཐོང་བ་ཞེས་བྱའོ། །
en: “In this way, Śāriputra, the bodhisatva makes an effort to apply himself in a way that is not superficial. He sees what non-superficial words are, and his seeing is just the same as not seeing. He sees in a way that is just like not seeing. He does not discern. Someone who sees like this is known as someone who sees things in a way that is not superficial.

source: ཤཱ་རིའི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ལ་ཡང་རྨོངས་པར་མི་འགྱུར་རོ། ། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ལ་ཆོས་གང་ཡང་གང་ཐར་པའི་སྒོར་མི་འགྱུར་མེད་དོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ཡང་སྤང་བའི་ཕྱིར་འབད་པ་མེད་དོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བ་ནི་ཆོས་གང་ཡང་རྟོགས་པར་བྱ་བའི་ཕྱིར་འབད་པ་མེད་དེ། གང་ཆོས་ཐམས་ཅད་ཡང་དག་པར་མཐོང་བ་དང་། ཇི་ལྟ་བ་བཞིན་མཐོང་བ་དེ་ནི་ཡང་དག་པར་ལྟ་བའོ། །
en: “Moreover, Śāriputra, the bodhisatva who applies himself in a way that is not superficial is not confused about any phenomena. For the bodhisatva who applies himself in a way that is not superficial, there are no phenomena whatsoever that do not become a door to liberation. Someone who applies himself in a way that is not superficial does not have to make an effort to give up any phenomena whatsoever. Someone who applies himself in a way that is not superficial does not have to make an effort to realize any phenomenon whatsoever. Right view is to see all phenomena in the right way, to see them just as they are.

source: ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་མི་མཐོང་བའོ། ། མི་མཐོང་བ་གང་ཞེ་ན། དེ་ནི་མ་སྐྱེས་པའི་ཚིག་བླ་དགས་སོ། ། མ་སྐྱེས་པ་ཞེས་བྱ་བ་གང་ཞེ་ན། དེ་ནི་མི་སྣང་བའི་བར་གྱི་ཚིག་བླ་དགས་ཏེ། རྒྱ་ཆེར་སྔར་ཇི་ལྟར་བཟླས་པ་དེ་ལྟར་དེ་བཞིན་དུ་བཟླས་པར་བྱ་སྟེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “What is it, then, to see all phenomena just as they are? It is a non-seeing. What is non-seeing? It is to use the designation unborn. What does unborn mean? It is another word for nonapparent, and so forth. Here, one can insert a further elaboration in the same way it was expressed previously, up to and including ‘This is how the bodhisatva practices the perfection of wisdom.’

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་འདི་ལྟར་སློབ་སྟེ། ཆོས་ཐམས་ཅད་ནི་བདག་བཞིན་དུ་ཚུལ་བཞིན་ཏེ་ཇི་ལྟར་བདག་ལ་བདག་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་བདག་མེད་པར་མཐོང་ངོ་། ། ཇི་ལྟར་སེམས་ཅན་བདག་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་བདག་མེད་པར་མཐོང་སྟེ། དེ་ལྟར་མཐོང་ན་ཚུལ་བཞིན་དུ་མཐོང་ངོ་། ། གང་ཚུལ་བཞིན་འཁོར་བའི་ཁམས་མཐོང་བ་དེ་ཚུལ་བཞིན་མྱ་ངན་ལས་འདས་པའི་ཁམས་དང་ལྡན་པར་མཐོང་སྟེ། དེ་ནི་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ཞེས་བྱའོ། ། དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་ཉོན་མོངས་པའི་རང་བཞིན་དུ་བྱེ་བྲག་མེད་པ་དང་ལྡན་པར་མཐོང་ངོ་། ། རྣལ་འབྱོར་དང་རྣལ་འབྱོར་མ་ཡིན་པར་ཡང་མི་སྙེམས་སོ། ། ཚུལ་བཞིན་དུ་སྦྱོར་བས་ཚུལ་བཞིན་མཐོང་སྟེ། ཚུལ་བཞིན་གྱི་སྦྱོར་བ་ཇི་སྙེད་པ་སེམས་ཅན་གྱི་གནས་ཐམས་ཅད་དེ་སྙེད་དེ། སེམས་ཅན་གྱི་གནས་ཀྱང་མི་མཐོང་། ཆོས་ཀྱི་གནས་ཀྱང་འཁྲུག་པར་མི་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་སྦྱོར་བ་སྟེ།
en: “Furthermore, Śāriputra, when the bodhisatva practices the perfection of wisdom, he trains in the following way. He sees that just as the self has no self, likewise all phenomena have no self, and this lack of self is the true self of all phenomena. He sees that just as a sentient being has no self, likewise all phenomena have no self. Seeing things in this way is to see things in a way that is not superficial. Someone who sees the realm of cyclic existence in a non-superficial way will see that it is fused with the realm of nirvāṇa. This is what can be described as non-superficial engagement. He sees that there is no difference at all between the nature of the vices and the nature of all phenomena. He does not entertain the conceit of distinguishing between practice and nonpractice. With non-superficial engagement he comes to see things in a way that is not superficial. There are as many varieties of non-superficial practice as there are ways to support all sentient beings, and he will not hinder anything that can act as a support for sentient beings. He will not sabotage anything that can act as a support for the Dharma. This is the non-superficial engagement of the bodhisatva.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་རྣམ་པ་འདི་དང་། ཐོས་པ་འདི་དང་། ཚུལ་བཞིན་དུ་འཇུག་པ་འདི་དང་། ཚུལ་བཞིན་མཐོང་བ་འདི་དང་། ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བའི་རྒྱུ་འཐུན་པ་འདི་དང་། འདི་དག་ནི་ཤེས་རབ་ཅེས་བྱ་སྟེ ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “These, Śāriputra, are the aspects of wisdom. This is learning. This is non-superficial engagement. This is seeing in a way that is not superficial. This is what facilitates seeing things the way they are. This is what is known as wisdom. This, then, Śāriputra, is how the bodhisatva practices the perfection of wisdom.
